# DuctFittingAndAccessoryPressureDropData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropData Class
Members See Also
---
The input and output data used by external servers for calculation of the duct fitting and duct accessory pressure drop.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DuctFittingAndAccessoryPressureDropData : IDisposable
```

Visual Basic
---
```text
Public Class DuctFittingAndAccessoryPressureDropData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DuctFittingAndAccessoryPressureDropData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Mechanical..::..DuctFittingAndAccessoryPressureDropData
# See Also
DuctFittingAndAccessoryPressureDropData Members
Autodesk.Revit.DB.Mechanical Namespace